# Pandas 使用 
    Series	   1D labeled homogeneously-typed array
    DataFrame	General 2D labeled, size-mutable tabular structure with potentially heterogeneously-typed columns
    Panel	    General 3D labeled, also size-mutable array
    
   官方教程：http://pandas.pydata.org/pandas-docs/stable/tutorials.html
   
   引用博客：
       http://blog.csdn.net/qq_16234613/article/details/62046057
       http://wiki.jikexueyuan.com/project/start-learning-python/311.html

# Series

In [104]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [110]:
s = Series([100, "Python", np.nan, None, "Snow"])
s

0       100
1    Python
2       NaN
3      None
4      Snow
dtype: object

In [4]:
s.values

array([100, 'Python', 'Snow'], dtype=object)

In [5]:
s.index

RangeIndex(start=0, stop=3, step=1)

In [6]:
s2 = Series([100, "Python", "Snow"], index=["one", "two", "three"])
s2

one         100
two      Python
three      Snow
dtype: object

In [7]:
s2.index

Index(['one', 'two', 'three'], dtype='object')

In [8]:
s2['one']

100

In [9]:
s2['one'] = '200'
s2

one         200
two      Python
three      Snow
dtype: object

In [12]:
sd = {"python":800, "c++":8100, "c#":4000}
s4 = Series(sd)
s4

c#        4000
c++       8100
python     800
dtype: int64

In [13]:
s6 = Series(sd, index=["java", "python", "c++", "c#"])
s6

java         NaN
python     800.0
c++       8100.0
c#        4000.0
dtype: float64

In [14]:
s5 = Series(sd, index=["java", "perl"])
s5

java   NaN
perl   NaN
dtype: float64

In [18]:
pd.isnull(s6)

java       True
python    False
c++       False
c#        False
dtype: bool

In [19]:
pd.notnull(s6)

java      False
python     True
c++        True
c#         True
dtype: bool

In [20]:
s6.isnull()

java       True
python    False
c++       False
c#        False
dtype: bool

In [22]:
s6.index = ["p1", "p2", "p3", "p4"]
s6

p1       NaN
p2     800.0
p3    8100.0
p4    4000.0
dtype: float64

In [23]:
s3 = Series([3, 9, 4, 7], index=['a', 'b', 'c', 'd'])
s3

a    3
b    9
c    4
d    7
dtype: int64

In [32]:
s3[s3 > 5]
# type(s3 > 5)
# s3 > 5

b    9
d    7
dtype: int64

In [25]:
s3 * 5

a    15
b    45
c    20
d    35
dtype: int64

In [38]:
s5 + s6
# s5
# s6

java   NaN
p1     NaN
p2     NaN
p3     NaN
p4     NaN
perl   NaN
dtype: float64

# DataFrame
DataFrame 是一种二维的数据结构，非常接近于电子表格或者类似 mysql 数据库的形式。它的竖行称之为 columns，横行跟前面的 Series 一样，称之为 index，也就是说可以通过 columns 和 index 来确定一个主句的位置。每一个列就是一个Series。

In [42]:
data = {"name":["yahoo","google","facebook"], "marks":[200,400,800], "price":[9, 3, 7]}
f1 = DataFrame(data)
f1

   marks      name  price
0    200     yahoo      9
1    400    google      3
2    800  facebook      7

In [43]:
f2 = DataFrame(data, columns=['name','price','marks']) 
f2

       name  price  marks
0     yahoo      9    200
1    google      3    400
2  facebook      7    800

In [44]:
f3 = DataFrame(data, columns=['name', 'price', 'marks', 'debt'], index=['a','b','c'])
f3

       name  price  marks debt
a     yahoo      9    200  NaN
b    google      3    400  NaN
c  facebook      7    800  NaN

In [45]:
newdata = {"lang":{"firstline":"python","secondline":"java"}, "price":{"firstline":8000}} 
f4 = DataFrame(newdata) 
f4

              lang   price
firstline   python  8000.0
secondline    java     NaN

In [46]:
DataFrame(newdata, index=["firstline","secondline","thirdline"])

              lang   price
firstline   python  8000.0
secondline    java     NaN
thirdline      NaN     NaN

In [47]:
f3.columns

Index(['name', 'price', 'marks', 'debt'], dtype='object')

In [48]:
f3['name']

a       yahoo
b      google
c    facebook
Name: name, dtype: object

In [50]:
f3['debt'] = 89.2 
f3

       name  price  marks  debt
a     yahoo      9    200  89.2
b    google      3    400  89.2
c  facebook      7    800  89.2

In [55]:
sdebt = Series([2.2, 3.3], index=["a","c"])    #注意索引 
f3['debt'] = sdebt
f3

       name  price  marks  debt
a     yahoo      9    200   2.2
b    google      3    400   NaN
c  facebook      7    800   3.3

In [111]:
f3["price"]["c"]= 300 
f3

D:\pr1\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

       name  price  marks  debt
a     yahoo      9    200   2.2
b    google      3    400   NaN
c  facebook    300    800   3.3

In [114]:
myDf = pd.DataFrame({ 'A' : 1.,
                     'B' : pd.Timestamp('20130102'),
                     'C' : pd.Series(1,index=list(range(4)),dtype='float32'),   #生成Series对象,取的是value
                     'D' : np.array([3] * 4,dtype='int32'),  #生成numpy对象
                     'E' : pd.Categorical(["test","train","test","train"]),
                     'F' : 'foo' }) 
myDf

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [118]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [120]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -0.223873  1.726579  0.298772  0.882170
2013-01-02 -0.078797 -0.803047 -0.628719  0.989032
2013-01-03  0.886370  0.699722 -0.448318  1.482011
2013-01-04  1.254062 -1.670705  1.315556 -1.180488
2013-01-05  0.848973 -0.474179  0.532279  1.211153
2013-01-06 -1.212062 -0.221165 -2.320933 -0.282623

In [121]:
df.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

In [123]:
df.head()    #默认值5

                   A         B         C         D
2013-01-01 -0.223873  1.726579  0.298772  0.882170
2013-01-02 -0.078797 -0.803047 -0.628719  0.989032
2013-01-03  0.886370  0.699722 -0.448318  1.482011
2013-01-04  1.254062 -1.670705  1.315556 -1.180488
2013-01-05  0.848973 -0.474179  0.532279  1.211153

In [124]:
df.tail(3)     #默认值5

                   A         B         C         D
2013-01-04  1.254062 -1.670705  1.315556 -1.180488
2013-01-05  0.848973 -0.474179  0.532279  1.211153
2013-01-06 -1.212062 -0.221165 -2.320933 -0.282623

In [126]:
df.values

array([[-0.22387277,  1.72657895,  0.29877168,  0.88216977],
       [-0.07879677, -0.80304748, -0.62871898,  0.98903157],
       [ 0.8863697 ,  0.69972167, -0.44831835,  1.4820105 ],
       [ 1.25406227, -1.67070495,  1.31555567, -1.18048792],
       [ 0.84897266, -0.47417908,  0.53227853,  1.21115266],
       [-1.21206165, -0.22116456, -2.32093273, -0.28262333]])

In [127]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [129]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [133]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.223873   -0.078797    0.886370    1.254062    0.848973   -1.212062
B    1.726579   -0.803047    0.699722   -1.670705   -0.474179   -0.221165
C    0.298772   -0.628719   -0.448318    1.315556    0.532279   -2.320933
D    0.882170    0.989032    1.482011   -1.180488    1.211153   -0.282623

In [134]:
df

                   A         B         C         D
2013-01-01 -0.223873  1.726579  0.298772  0.882170
2013-01-02 -0.078797 -0.803047 -0.628719  0.989032
2013-01-03  0.886370  0.699722 -0.448318  1.482011
2013-01-04  1.254062 -1.670705  1.315556 -1.180488
2013-01-05  0.848973 -0.474179  0.532279  1.211153
2013-01-06 -1.212062 -0.221165 -2.320933 -0.282623

In [132]:
df.loc[dates[0]]        #选择一行，会降维

A   -0.223873
B    1.726579
C    0.298772
D    0.882170
Name: 2013-01-01 00:00:00, dtype: float64

In [135]:
df.loc[:,['A','B']]  #局部选择

                   A         B
2013-01-01 -0.223873  1.726579
2013-01-02 -0.078797 -0.803047
2013-01-03  0.886370  0.699722
2013-01-04  1.254062 -1.670705
2013-01-05  0.848973 -0.474179
2013-01-06 -1.212062 -0.221165

In [136]:
df.loc[dates[0],'A'] # 通过行键，列键

-0.22387276632990968

In [137]:
df.at[dates[0],'A']

-0.22387276632990968

In [140]:
df

                   A         B         C         D
2013-01-01 -0.223873  1.726579  0.298772  0.882170
2013-01-02 -0.078797 -0.803047 -0.628719  0.989032
2013-01-03  0.886370  0.699722 -0.448318  1.482011
2013-01-04  1.254062 -1.670705  1.315556 -1.180488
2013-01-05  0.848973 -0.474179  0.532279  1.211153
2013-01-06 -1.212062 -0.221165 -2.320933 -0.282623

In [139]:
df.iloc[3] #通过位置选择

A    1.254062
B   -1.670705
C    1.315556
D   -1.180488
Name: 2013-01-04 00:00:00, dtype: float64

In [141]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04  1.254062 -1.670705
2013-01-05  0.848973 -0.474179

In [142]:
df[df.A > 0]

                   A         B         C         D
2013-01-03  0.886370  0.699722 -0.448318  1.482011
2013-01-04  1.254062 -1.670705  1.315556 -1.180488
2013-01-05  0.848973 -0.474179  0.532279  1.211153

In [143]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN  1.726579  0.298772  0.882170
2013-01-02       NaN       NaN       NaN  0.989032
2013-01-03  0.886370  0.699722       NaN  1.482011
2013-01-04  1.254062       NaN  1.315556       NaN
2013-01-05  0.848973       NaN  0.532279  1.211153
2013-01-06       NaN       NaN       NaN       NaN

# 读取csv文件
      csv 是一种通用的、相对简单的文件格式，在表格类型的数据中用途很广泛，很多关系型数据库都支持这种类型文件的导入导出，并且 excel 这种常用的数据表格也能和 csv 文件之间转换。
      逗号分隔值（Comma-Separated Values，CSV，有时也称为字符分隔值，因为分隔字符也可以不是逗号），其文件以纯文本形式存储表格数据（数字和文本）。纯文本意味着该文件是一个字符序列，不含必须象二进制数字那样被解读的数据。CSV 文件由任意数目的记录组成，记录间以某种换行符分隔；每条记录由字段组成，字段间的分隔符是其它字符或字符串，最常见的是逗号或制表符。通常，所有记录都有完全相同的字段序列。

In [63]:
with open("../../data/pandas/marks.csv") as f:
    for line in f:
        print(line)

name,physics,python,math,english

Google,100,100,25,12

Facebook,45,54,44,88

Twitter,54,76,13,91

Yahoo,54,452,26,100

In [64]:
import csv
dir(csv)

['Dialect',
 'DictReader',
 'DictWriter',
 'Error',
 'OrderedDict',
 'QUOTE_ALL',
 'QUOTE_MINIMAL',
 'QUOTE_NONE',
 'QUOTE_NONNUMERIC',
 'Sniffer',
 'StringIO',
 '_Dialect',
 '__all__',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__file__',
 '__loader__',
 '__name__',
 '__package__',
 '__spec__',
 '__version__',
 'excel',
 'excel_tab',
 'field_size_limit',
 'get_dialect',
 'list_dialects',
 're',
 'reader',
 'register_dialect',
 'unix_dialect',
 'unregister_dialect',
 'writer']

In [66]:
import csv 
csv_reader = csv.reader(open("../../data/pandas/marks.csv"))
for row in csv_reader:
    print(row)

['name', 'physics', 'python', 'math', 'english']
['Google', '100', '100', '25', '12']
['Facebook', '45', '54', '44', '88']
['Twitter', '54', '76', '13', '91']
['Yahoo', '54', '452', '26', '100']

In [89]:
import pandas as pd
marks = pd.read_csv("../../data/pandas/marks.csv")
marks

       name  physics  python  math  english
0    Google      100     100    25       12
1  Facebook       45      54    44       88
2   Twitter       54      76    13       91
3     Yahoo       54     452    26      100

In [69]:
pd.read_table("../../data/pandas/marks.csv", sep=",")

       name  physics  python  math  english
0    Google      100     100    25       12
1  Facebook       45      54    44       88
2   Twitter       54      76    13       91
3     Yahoo       54     452    26      100

In [70]:
dir(marks)

['T',
 '_AXIS_ALIASES',
 '_AXIS_IALIASES',
 '_AXIS_LEN',
 '_AXIS_NAMES',
 '_AXIS_NUMBERS',
 '_AXIS_ORDERS',
 '_AXIS_REVERSED',
 '_AXIS_SLICEMAP',
 '__abs__',
 '__add__',
 '__and__',
 '__array__',
 '__array_wrap__',
 '__bool__',
 '__bytes__',
 '__class__',
 '__contains__',
 '__copy__',
 '__deepcopy__',
 '__delattr__',
 '__delitem__',
 '__dict__',
 '__dir__',
 '__div__',
 '__doc__',
 '__eq__',
 '__finalize__',
 '__floordiv__',
 '__format__',
 '__ge__',
 '__getattr__',
 '__getattribute__',
 '__getitem__',
 '__getstate__',
 '__gt__',
 '__hash__',
 '__iadd__',
 '__imul__',
 '__init__',
 '__init_subclass__',
 '__invert__',
 '__ipow__',
 '__isub__',
 '__iter__',
 '__itruediv__',
 '__le__',
 '__len__',
 '__lt__',
 '__mod__',
 '__module__',
 '__mul__',
 '__ne__',
 '__neg__',
 '__new__',
 '__nonzero__',
 '__or__',
 '__pow__',
 '__radd__',
 '__rand__',
 '__rdiv__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__rfloordiv__',
 '__rmod__',
 '__rmul__',
 '__ror__',
 '__round__',
 '__rpow__',
 '__rsub__',
 '__rtruediv__',
 '__rxor__',
 '__setattr__',
 '__setitem__',
 '__setstate__',
 '__sizeof__',
 '__str__',
 '__sub__',
 '__subclasshook__',
 '__truediv__',
 '__unicode__',
 '__weakref__',
 '__xor__',
 '_accessors',
 '_add_numeric_operations',
 '_add_series_only_operations',
 '_add_series_or_dataframe_operations',
 '_agg_by_level',
 '_agg_doc',
 '_aggregate',
 '_aggregate_multiple_funcs',
 '_align_frame',
 '_align_series',
 '_apply_broadcast',
 '_apply_empty_result',
 '_apply_raw',
 '_apply_standard',
 '_at',
 '_box_col_values',
 '_box_item_values',
 '_builtin_table',
 '_check_inplace_setting',
 '_check_is_chained_assignment_possible',
 '_check_percentile',
 '_check_setitem_copy',
 '_clear_item_cache',
 '_clip_with_scalar',
 '_combine_const',
 '_combine_frame',
 '_combine_match_columns',
 '_combine_match_index',
 '_combine_series',
 '_combine_series_infer',
 '_compare_frame',
 '_compare_frame_evaluate',
 '_consolidate',
 '_consolidate_inplace',
 '_construct_axes_dict',
 '_construct_axes_dict_for_slice',
 '_construct_axes_dict_from',
 '_construct_axes_from_arguments',
 '_constructor',
 '_constructor_expanddim',
 '_constructor_sliced',
 '_convert',
 '_count_level',
 '_create_indexer',
 '_cython_table',
 '_dir_additions',
 '_dir_deletions',
 '_ensure_valid_index',
 '_expand_axes',
 '_flex_compare_frame',
 '_from_arrays',
 '_from_axes',
 '_get_agg_axis',
 '_get_axis',
 '_get_axis_name',
 '_get_axis_number',
 '_get_axis_resolvers',
 '_get_block_manager_axis',
 '_get_bool_data',
 '_get_cacher',
 '_get_index_resolvers',
 '_get_item_cache',
 '_get_numeric_data',
 '_get_values',
 '_getitem_array',
 '_getitem_column',
 '_getitem_frame',
 '_getitem_multilevel',
 '_getitem_slice',
 '_gotitem',
 '_iat',
 '_iget_item_cache',
 '_iloc',
 '_indexed_same',
 '_info_axis',
 '_info_axis_name',
 '_info_axis_number',
 '_info_repr',
 '_init_dict',
 '_init_mgr',
 '_init_ndarray',
 '_internal_names',
 '_internal_names_set',
 '_is_builtin_func',
 '_is_cached',
 '_is_cython_func',
 '_is_datelike_mixed_type',
 '_is_mixed_type',
 '_is_numeric_mixed_type',
 '_is_view',
 '_ix',
 '_ixs',
 '_join_compat',
 '_loc',
 '_maybe_cache_changed',
 '_maybe_update_cacher',
 '_metadata',
 '_needs_reindex_multi',
 '_obj_with_exclusions',
 '_protect_consolidate',
 '_reduce',
 '_reindex_axes',
 '_reindex_axis',
 '_reindex_columns',
 '_reindex_index',
 '_reindex_multi',
 '_reindex_with_indexers',
 '_repr_data_resource_',
 '_repr_fits_horizontal_',
 '_repr_fits_vertical_',
 '_repr_html_',
 '_repr_latex_',
 '_reset_cache',
 '_reset_cacher',
 '_sanitize_column',
 '_selected_obj',
 '_selection',
 '_selection_list',
 '_selection_name',
 '_series',
 '_set_as_cached',
 '_set_axis',
 '_set_axis_name',
 '_set_is_copy',
 '_set_item',
 '_setitem_array',
 '_setitem_frame',
 '_setitem_slice',
 '_setup_axes',
 '_shallow_copy',
 '_slice',
 '_stat_axis',
 '_stat_axis_name',
 '_stat_axis_number',
 '_try_aggregate_string_function',
 '_typ',
 '_unpickle_frame_compat',
 '_unpickle_matrix_compat',
 '_update_inplace',
 '_validate_dtype',
 '_values',
 '_where',
 '_xs',
 'abs',
 'add',
 'add_prefix',
 'add_suffix',
 'agg',
 'aggregate',
 'align',
 'all',
 'any',
 'append',
 'apply',
 'applymap',
 'as_blocks',
 'as_matrix',
 'asfreq',
 'asof',
 'assign',
 'astype',
 'at',
 'at_time',
 'axes',
 'between_time',
 'bfill',
 'blocks',
 'bool',
 'boxplot',
 'clip',
 'clip_lower',
 'clip_upper',
 'columns',
 'combine',
 'combine_first',
 'compound',
 'consolidate',
 'convert_objects',
 'copy',
 'corr',
 'corrwith',
 'count',
 'cov',
 'cummax',
 'cummin',
 'cumprod',
 'cumsum',
 'describe',
 'diff',
 'div',
 'divide',
 'dot',
 'drop',
 'drop_duplicates',
 'dropna',
 'dtypes',
 'duplicated',
 'empty',
 'english',
 'eq',
 'equals',
 'eval',
 'ewm',
 'expanding',
 'ffill',
 'fillna',
 'filter',
 'first',
 'first_valid_index',
 'floordiv',
 'from_csv',
 'from_dict',
 'from_items',
 'from_records',
 'ftypes',
 'ge',
 'get',
 'get_dtype_counts',
 'get_ftype_counts',
 'get_value',
 'get_values',
 'groupby',
 'gt',
 'head',
 'hist',
 'iat',
 'idxmax',
 'idxmin',
 'iloc',
 'index',
 'info',
 'insert',
 'interpolate',
 'is_copy',
 'isin',
 'isnull',
 'items',
 'iteritems',
 'iterrows',
 'itertuples',
 'ix',
 'join',
 'keys',
 'kurt',
 'kurtosis',
 'last',
 'last_valid_index',
 'le',
 'loc',
 'lookup',
 'lt',
 'mad',
 'mask',
 'math',
 'max',
 'mean',
 'median',
 'melt',
 'memory_usage',
 'merge',
 'min',
 'mod',
 'mode',
 'mul',
 'multiply',
 'name',
 'ndim',
 'ne',
 'nlargest',
 'notnull',
 'nsmallest',
 'nunique',
 'pct_change',
 'physics',
 'pipe',
 'pivot',
 'pivot_table',
 'plot',
 'pop',
 'pow',
 'prod',
 'product',
 'python',
 'quantile',
 'query',
 'radd',
 'rank',
 'rdiv',
 'reindex',
 'reindex_axis',
 'reindex_like',
 'rename',
 'rename_axis',
 'reorder_levels',
 'replace',
 'resample',
 'reset_index',
 'rfloordiv',
 'rmod',
 'rmul',
 'rolling',
 'round',
 'rpow',
 'rsub',
 'rtruediv',
 'sample',
 'select',
 'select_dtypes',
 'sem',
 'set_axis',
 'set_index',
 'set_value',
 'shape',
 'shift',
 'size',
 'skew',
 'slice_shift',
 'sort_index',
 'sort_values',
 'sortlevel',
 'squeeze',
 'stack',
 'std',
 'style',
 'sub',
 'subtract',
 'sum',
 'swapaxes',
 'swaplevel',
 'tail',
 'take',
 'to_clipboard',
 'to_csv',
 'to_dense',
 'to_dict',
 'to_excel',
 'to_feather',
 'to_gbq',
 'to_hdf',
 'to_html',
 'to_json',
 'to_latex',
 'to_msgpack',
 'to_panel',
 'to_period',
 'to_pickle',
 'to_records',
 'to_sparse',
 'to_sql',
 'to_stata',
 'to_string',
 'to_timestamp',
 'to_xarray',
 'transform',
 'transpose',
 'truediv',
 'truncate',
 'tshift',
 'tz_convert',
 'tz_localize',
 'unstack',
 'update',
 'values',
 'var',
 'where',
 'xs']

In [71]:
marks.index

RangeIndex(start=0, stop=4, step=1)

In [72]:
marks.columns

Index(['name', 'physics', 'python', 'math', 'english'], dtype='object')

In [86]:
marks['name'][1]

'Facebook'

In [90]:
marks

       name  physics  python  math  english
0    Google      100     100    25       12
1  Facebook       45      54    44       88
2   Twitter       54      76    13       91
3     Yahoo       54     452    26      100

pandas.DataFrame.sort_values:http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.sort_values.html

In [95]:
marks.sort_values(by=['python', 'math'], ascending=False)
# marks.sort_values(by=['python', 'math'], ascending=False, inplace=True)
# %psource marks.sort_values

       name  physics  python  math  english
3     Yahoo       54     452    26      100
0    Google      100     100    25       12
2   Twitter       54      76    13       91
1  Facebook       45      54    44       88

In [94]:
marks

       name  physics  python  math  english
3     Yahoo       54     452    26      100
0    Google      100     100    25       12
2   Twitter       54      76    13       91
1  Facebook       45      54    44       88

pandas.DataFrame.sort_index:http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.sort_index.html?highlight=sort_index#pandas.DataFrame.sort_index

In [96]:
marks.sort_index()

       name  physics  python  math  english
0    Google      100     100    25       12
1  Facebook       45      54    44       88
2   Twitter       54      76    13       91
3     Yahoo       54     452    26      100

In [97]:
marks[:1]

    name  physics  python  math  english
3  Yahoo       54     452    26      100

In [98]:
marks[1:2]

     name  physics  python  math  english
0  Google      100     100    25       12

In [99]:
marks["physics"]

3     54
0    100
2     54
1     45
Name: physics, dtype: int64

# 汇总和统计
    + sum
    + mean
    + max
    + idxmin 最小值 索引
    + idxmax
    + cumsum
    + describe
    + info
    + corr(): 相关系数
    + cov()：协方差
    + unique:可以得到Series中的唯一值数组。
    + isin：用于判断矢量化集合的成员资格
    + value_counts:用于计算一个Series中各值出现的概率。

In [100]:
marks.describe()

          physics      python       math     english
count    4.000000    4.000000   4.000000    4.000000
mean    63.250000  170.500000  27.000000   72.750000
std     24.864634  188.604525  12.780193   40.819726
min     45.000000   54.000000  13.000000   12.000000
25%     51.750000   70.500000  22.000000   69.000000
50%     54.000000   88.000000  25.500000   89.500000
75%     65.500000  188.000000  30.500000   93.250000
max    100.000000  452.000000  44.000000  100.000000

In [101]:
marks.cov()

            physics        python        math      english
physics  618.250000   -731.500000  -81.666667  -977.250000
python  -731.500000  35571.666667 -266.000000  2817.500000
math     -81.666667   -266.000000  163.333333    32.666667
english -977.250000   2817.500000   32.666667  1666.250000

In [103]:
marks['physics'].value_counts()

54     2
45     1
100    1
Name: physics, dtype: int64